Как появился Python
В конце восьмидесятых голландский программист Гвидо ван Россум работал 
в научно-исследовательском центре математики и информатики, в котором 
создавал язык программирования ABC. Гвидо вкладывал все силы в этот проект 
и многому научился в работе над ним.

В декабре 1989 года офис закрылся на рождественские каникулы, и Гвидо 
было нечем заняться. Тогда он просто ради развлечения написал 
интерпретатор для нового языка программирования. 
Свой несерьезный проект он назвал «Пайтон» в честь
 любимого комедийного шоу «Летающий Цирк Монти Пайтона».
